In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [10]:
index = [1,2,3]
names= ['khaled','abdullah','hanan']
s= pd.Series(names, index=index)
s

1      khaled
2    abdullah
3       hanan
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [15]:
# first way
s= pd.Series(names, index =['11', '12', '13'])
#Second way
s.index = [11, 12, 13]
s

11      khaled
12    abdullah
13       hanan
dtype: object

## Q3: Retrieve First and second elements.

In [12]:
s[:2]

11      khaled
12    abdullah
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [35]:
names = {10: 'Nourah', 12: 'Sarah', 13: 'Ahmed', 14: 'Lama'}
s3 = pd.Series(names)
s3
s5= pd.Series({50: 'Ahmed', 60: 'Lama'})
s6= pd.concat([s3,s5], ignore_index= False)
s6.drop_duplicates()

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [32]:
lst= {'ID':[437,438,439],' Name': ['Omar','Khaled','Othman'], 'GPA': [5,5,5]}
    
students= pd.DataFrame(lst, columns=['ID','Name','GPA'])
students

    ID Name  GPA
0  437  NaN    5
1  438  NaN    5
2  439  NaN    5

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [38]:
edu= pd.read_csv('educ_figdp_1_Data.csv')
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [43]:
edu.loc[:3]

edu[:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e